{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": { "type": "Whitespace" },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      { "SpecialToken": { "id": "[BOS]", "type_id": 0 } },
      { "Sequence": { "id": "A", "type_id": 0 } }
    ],
    "pair": [
      { "Sequence": { "id": "A", "type_id": 0 } },
      { "Sequence": { "id": "B", "type_id": 1 } }
    ],
    "special_tokens": {
      "[BOS]": { "id": "[BOS]", "ids": [3], "tokens": ["[BOS]"] }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": { "hello": 0, "world": 1, "[UNK]": 2, "[BOS]": 3 },
    "unk_token": "[UNK]"
  }
}
